"""
В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами. За каждой партой может сидеть два учащихся. Известно количество учащихся в каждом из трех классов. Выведите наименьшее число парт, которое нужно приобрести для них.
Input: 20 21 22(ввод чисел НЕ в одну строку)
Output: 32
"""
print("Введите три числа:")
a = int(input())
b = int(input())
c = int(input())

sum = a + b + c

if (sum % 2 != 0):
    print(sum//2 + 1)
else:
    print(sum//2)
